src/Documents/ПриказОДвиженииКонтингета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриказОДвиженииКонтингета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КурсыУчебныхГрупп</xr:Item>
				<xr:Item>InformationRegister.ДвижениеКонтингента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПриказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачислениеВГруппу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формулировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеНазваниеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтудента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтудента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтудентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидФинансирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриказаОЗачислении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриказаОЗачислении</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодписиДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолЧеловека</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФинансирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачисленПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБилета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗачетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедПолисНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедПолисСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Номер, серия. кем выдан, дата выдачи, код подразделения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтудента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтудента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ПриказОДвиженииКонтингета/Forms/ФормаДокументаДругойКурс/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрочкаСтудента из Объект.СписокСтудентов Цикл
		ВидФинансирования = СтрочкаСтудента.ВидФинансирования;
		ЗаписатьИнформациюНаСтудента(СтрочкаСтудента.Студент, Объект.Курс, ВидФинансирования);
	КонецЦикла;
	ИзменитьКурсГруппы(Объект.ЗачислениеВГруппу, Объект.Курс);
	ПереименоватьГруппу(Объект.ЗачислениеВГруппу, Объект.НовоеНазваниеГруппы);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнформациюНаСтудента(Студент, КурсСтудента, ВидФинансирования)
	СтудентСсылка = Студент;
	СтудентОбъект = СтудентСсылка.ПолучитьОбъект();
	
	СтудентОбъект.Отделение = Объект.Отделение;
	СтудентОбъект.Курс = КурсСтудента;
	СтудентОбъект.ВидФинансирования = ВидФинансирования;
	
	СтудентОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОткрытьФорму(ДвижениеКонтингента.ПолучитьФормуИзВидаПриказа(ВыбранноеЗначение));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереименоватьГруппу(УчебнаяГруппа, НовоеНазваниеГруппы)
	УчебнаяГруппаОбъект = УчебнаяГруппа.ПолучитьОбъект();
	УчебнаяГруппаОбъект.Наименование = НовоеНазваниеГруппы;
	УчебнаяГруппаОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ВидПриказа = ДвижениеКонтингента.ПолучитьВидыПриказов().ПереводНаДругойКурс;
	Объект.СтатусСтудента = ДвижениеКонтингента.ПолучитьСтатусыСтудента().Студент;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуНаСервере(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Студенты.Ссылка КАК Студент,
		|	Студенты.ВидФинансирования КАК ВидФинансирования,
		|	Студенты.УчебнаяГруппа КАК УчебнаяГруппа
		|ИЗ
		|	Справочник.Студенты КАК Студенты
		|ГДЕ
		|	Студенты.УчебнаяГруппа = &УчебнаяГруппа;";
	
	Запрос.УстановитьПараметр("УчебнаяГруппа", Группа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	// ДокОбъект.СписокСтудентов.Загрузить(Запрос.Выполнить().Выгрузить());
	// ЗначениеВДанныеФормы(ДокОбъект, "Объект");
	Пока Выборка.Следующий() Цикл
        НовСтр = Объект.СписокСтудентов.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппу(Команда)
	Если ЗначениеЗаполнено(Объект.ЗачислениеВГруппу) Тогда
		ЗаполнитьГруппуНаСервере(Объект.ЗачислениеВГруппу);
	Иначе Сообщить("Группа не выбрана!");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурсГруппы(УчебнаяГруппа)
	Возврат УчебнаяГруппа.Курс;
КонецФункции

&НаСервереБезКонтекста
Функция ИзменитьКурсГруппы(УчебнаяГруппа, НовыйКурс)
	УчебнаяГруппаОбъект = УчебнаяГруппа.ПолучитьОбъект();
	УчебнаяГруппаОбъект.Курс = НовыйКурс;
	УчебнаяГруппаОбъект.Записать();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтедениеГруппы(Группа)
	Возврат Группа.Отделение;
КонецФункции

&НаКлиенте
Процедура ЗачислениеВГруппуПриИзменении(Элемент)
	Объект.Курс = ПолучитьКурсГруппы(Объект.ЗачислениеВГруппу) + 1;
	Объект.НовоеНазваниеГруппы = Объект.ЗачислениеВГруппу;
	Объект.Отделение = ПолучитьОтедениеГруппы(Объект.ЗачислениеВГруппу);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
КонецПроцедуры
